app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    if @post.save(post_params)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Second"], ["body", "<p>Let&#39;s try again</p>\r\n"], ["created_at", 2017-01-02 01:10:30 UTC], ["updated_at", 2017-01-02 01:10:30 UTC]]

  def update
    if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "First"], ["updated_at", 2017-01-02 01:20:54 UTC], ["id", 3]]

  def destroy
    find_post
    if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]